{
  "_name_or_path": "microsoft/layoutlmv3-base",
  "architectures": [
    "LayoutLMv3ForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "coordinate_size": 128,
  "eos_token_id": 2,
  "has_relative_attention_bias": true,
  "has_spatial_attention_bias": true,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "S-ITEMS",
    "1": "B-MERCHANTADDRESS",
    "2": "B-ITEMS",
    "3": "I-MERCHANTNAME",
    "4": "E-VATTAX",
    "5": "O",
    "6": "B-VATTAX",
    "7": "B-PRICE",
    "8": "S-RECEIPTNUMBER",
    "9": "S-PRICE",
    "10": "E-TRANSACTIONDATE",
    "11": "E-RECEIPTNUMBER",
    "12": "B-MERCHANTNAME",
    "13": "E-MERCHANTADDRESS",
    "14": "B-TOTAL",
    "15": "S-TOTAL",
    "16": "I-MERCHANT NAME",
    "17": "S-MERCHANTNAME",
    "18": "S-VATTAX",
    "19": "S-TRANSACTIONDATE",
    "20": "E-TRANSACTIONTIME",
    "21": "I-MERCHANTADDRESS",
    "22": "I-ITEMS",
    "23": "E-MERCHANTNAME",
    "24": "E-ITEMS",
    "25": "B-RECEIPTNUMBER",
    "26": "E-TOTAL",
    "27": "E-MERCHANT NAME",
    "28": "I-RECEIPTNUMBER",
    "29": "B-TRANSACTIONDATE",
    "30": "B-TRANSACTIONTIME",
    "31": "E-PRICE",
    "32": "I-TRANSACTIONTIME",
    "33": "S-TRANSACTIONTIME",
    "34": "S-MERCHANTADDRESS",
    "35": "I-TRANSACTIONDATE",
    "36": "B-MERCHANT NAME"
  },
  "initializer_range": 0.02,
  "input_size": 224,
  "intermediate_size": 3072,
  "label2id": {
    "B-ITEMS": 2,
    "B-MERCHANT NAME": 36,
    "B-MERCHANTADDRESS": 1,
    "B-MERCHANTNAME": 12,
    "B-PRICE": 7,
    "B-RECEIPTNUMBER": 25,
    "B-TOTAL": 14,
    "B-TRANSACTIONDATE": 29,
    "B-TRANSACTIONTIME": 30,
    "B-VATTAX": 6,
    "E-ITEMS": 24,
    "E-MERCHANT NAME": 27,
    "E-MERCHANTADDRESS": 13,
    "E-MERCHANTNAME": 23,
    "E-PRICE": 31,
    "E-RECEIPTNUMBER": 11,
    "E-TOTAL": 26,
    "E-TRANSACTIONDATE": 10,
    "E-TRANSACTIONTIME": 20,
    "E-VATTAX": 4,
    "I-ITEMS": 22,
    "I-MERCHANT NAME": 16,
    "I-MERCHANTADDRESS": 21,
    "I-MERCHANTNAME": 3,
    "I-RECEIPTNUMBER": 28,
    "I-TRANSACTIONDATE": 35,
    "I-TRANSACTIONTIME": 32,
    "O": 5,
    "S-ITEMS": 0,
    "S-MERCHANTADDRESS": 34,
    "S-MERCHANTNAME": 17,
    "S-PRICE": 9,
    "S-RECEIPTNUMBER": 8,
    "S-TOTAL": 15,
    "S-TRANSACTIONDATE": 19,
    "S-TRANSACTIONTIME": 33,
    "S-VATTAX": 18
  },
  "layer_norm_eps": 1e-05,
  "max_2d_position_embeddings": 1024,
  "max_position_embeddings": 514,
  "max_rel_2d_pos": 256,
  "max_rel_pos": 128,
  "model_type": "layoutlmv3",
  "num_attention_heads": 12,
  "num_channels": 3,
  "num_hidden_layers": 12,
  "pad_token_id": 1,
  "patch_size": 16,
  "rel_2d_pos_bins": 64,
  "rel_pos_bins": 32,
  "second_input_size": 112,
  "shape_size": 128,
  "text_embed": true,
  "torch_dtype": "float32",
  "transformers_version": "4.36.0.dev0",
  "type_vocab_size": 1,
  "visual_embed": true,
  "vocab_size": 50265
}
